configuration/rust/load_test_rust_k_read.yml
config:
  target: "http://127.0.0.1:8017"
  plugins:
    # expect: {}  
  phases:
    - duration: 120
      arrivalRate: 50
      maxVusers: 50  
      name: Constant loan      
 
scenarios:         
  - name: "Rust | K - Retrieving, storing data and retrieving"
    flow:
    - get:
        url: "/num-comp-ram"